app/Helper/helper.php

select * from `users` where `type` = 'super admin' limit 1
select `value`, `key` from `settings` where `created_by` = 1 and `workspace` = 0
---
    function getAdminAllSetting()
    {
        try {
            // Laravel cache
            return Cache::rememberForever('admin_settings', function () {
                $super_admin = User::where('type', 'super admin')->first();
                $settings = [];
                if ($super_admin) {
                    $settings = Setting::where('created_by', $super_admin->id)->where('workspace', $super_admin->active_workspace)->pluck('value', 'key')->toArray();

select * from `users` where `users`.`id` = 2 limit 1
select `value`, `key` from `settings` where `created_by` = 2 and `workspace` = 1
---
    function getCompanyAllSetting($user_id = null, $workspace = null)
    {
        if (!empty($user_id)) {
            $user = User::find($user_id);
        } else {
            $user =  auth()->user();
        }

        $workspace = $workspace ?? $user->active_workspace;

        // Check if the user is not 'company' or 'super admin' and find the creator
        if (!in_array($user->type, ['company', 'super admin'])) {
            $user = User::find($user->created_by);
        }

        if (!empty($user)) {
            $key = 'company_settings_' . $workspace . '_' . $user->id;
            return Cache::rememberForever($key, function () use ($user, $workspace) {
                $settings = [];
                $settings = Setting::where('created_by', $user->id)->where('workspace', $workspace)->pluck('value', 'key')->toArray();
                return $settings;
            });

select * from `users` where `email` = 'test.demo@superadmin.com'
---
    function getWorkspace()
    {
        $data = [];
        if (Auth::check()) {
            static $users = null;
            if ($users == null) {
                $users = User::where('email', Auth::user()->email)->get();

select * from `users` where `users`.`id` is null limit 1
---
    function module_is_active($module, $user_id = null)
    {
        if (Module::has($module)) {
            $isModuleActive = Module::isEnabled($module);
            if ($isModuleActive == false) {
                return false;
            }
            if (Auth::check()) {
                $user = Auth::user();
            } else {
                $user = User::find($user_id);

select * from `users` where `users`.`id` = 2 limit 1
---
    function ActivatedModule($user_id = null)
    {
        $activated_module = user::$superadmin_activated_module;

        if ($user_id != null) {
            $user = User::find($user_id);

select * from `currencies`
---
    function currency($code = null)
    {
        if ($code == null) {
            $c = Currency::get();

select * from `users` where `id` = 1114 limit 1
---
    function PlanCheck($type = 'User', $id = null)
    {
        if (!empty($id)) {
            $user = User::where('id', $id)->first();

select * from `work_spaces` where `created_by` = 1114
---
        }
        if ($type == "Workspace") {
            if ($user->total_workspace >= 0) {
                $workspace = WorkSpace::where('created_by', $id)->get();