app/Http/Controllers/InvoiceController.php

    public function show($e_id)
    {
        if (Auth::user()->isAbleTo('invoice show')) {
            try {
                $id       = Crypt::decrypt($e_id);
            } catch (\Throwable $th) {
                return redirect()->back()->with('error', __('Invoice Not Found.'));
            }
            $invoice = Invoice::find($id);
            if ($invoice) {
                $company_settings = getCompanyAllSetting();
                $bank_transfer_payments = BankTransferPayment::where('created_by', creatorId())->where('workspace', getActiveWorkSpace())->where('type', 'invoice')->where('request', $invoice->id)->get();
                if ($invoice->workspace == getActiveWorkSpace()) {
                    $invoicePayment = InvoicePayment::where('invoice_id', $invoice->id)->first();
                    $invoice_attachment = InvoiceAttechment::where('invoice_id', $invoice->id)->get();
                    if (module_is_active('Account')) {
                        $customer = \Workdo\Account\Entities\Customer::where('user_id', $invoice->user_id)->where('workspace', getActiveWorkSpace())->first();
---
select * from `invoices` where `invoices`.`id` = 6 limit 1
select * from `bank_transfer_payments` where `created_by` = 2 and `workspace` = 1 and `type` = 'invoice' and `request` = 6
select * from `invoice_payments` where `invoice_id` = 6 limit 1
select * from `invoice_attechments` where `invoice_id` = 6
select * from `customers` where `user_id` = 17 and `workspace` = 1 limit 1

    public function invoice($invoice_id)
    {
        try {
            $invoiceId = Crypt::decrypt($invoice_id);
        } catch (\Throwable $th) {
            return redirect()->back()->with('error', __('Invoice Not Found.'));
        }
        $invoice   = Invoice::where('id', $invoiceId)->first();
        $bank_accounts = InvoicePayment::where('invoice_id', $invoiceId)->get()->pluck('account_id');
        $bank_details = BankAccount::whereIn('id', $bank_accounts)->get();

        $bank_details_list = [];
        foreach ($bank_details as $bank_detail) {
            $bankDetail = new \stdClass();
            $bankDetail->holder_name = $bank_detail->holder_name;
            $bankDetail->bank_name = $bank_detail->bank_name;
            $bankDetail->account_number = $bank_detail->account_number;
            $bankDetail->opening_balance = $bank_detail->opening_balance;
            $bankDetail->contact_number = $bank_detail->contact_number;
            $bankDetail->bank_address = $bank_detail->bank_address;

            $bank_details_list[] = $bankDetail;
        }

        if (module_is_active('Account')) {
            $customer         = \Workdo\Account\Entities\Customer::where('user_id', $invoice->user_id)->first();
---
select * from `invoices` where `id` = 6 limit 1
select * from `invoice_payments` where `invoice_id` = 6
select * from `customers` where `user_id` = 17 limit 1