app/Http/Controllers/UserController.php

    public function index(Request $request)
    {

        if(Auth::user()->isAbleTo('user manage'))
        {
            if(Auth::user()->type == 'super admin')
            {
                $roles =[];
                $users = User::where('type','company')->get();
---
select * from `users` where `type` = 'company'

    public function LoginWithCompany(Request $request, User $user,  $id)
    {
        $user = User::find($id);
---
select * from `users` where `users`.`id` = '2' limit 1