app/Models/Invoice.php

select sum(`amount`) as aggregate from `credit_notes` where `credit_notes`.`invoice` is null and `credit_notes`.`invoice` is not null
---
    public function invoiceTotalCreditNote()
    {
        if(module_is_active('Account'))
        {
            return $this->hasMany(\Workdo\Account\Entities\CreditNote::class, 'invoice', 'id')->sum('amount');

select * from `taxes` where `taxes`.`id` = '3' limit 1
---
    public static function tax($taxes)
    {
        if(module_is_active('ProductService'))
        {
            $taxArr = explode(',', $taxes);
            $taxes  = [];
            foreach($taxArr as $tax)
            {
                $taxes[] = \Workdo\ProductService\Entities\Tax::find($tax);

select * from `taxes` where `taxes`.`id` = '3' limit 1
---
    public static function totalTaxRate($taxes)
    {
        if(module_is_active('ProductService'))
        {
            $taxArr  = explode(',', $taxes);
            $taxRate = 0;
            foreach($taxArr as $tax)
            {
                $tax     = \Workdo\ProductService\Entities\Tax::find($tax);