app/Models/Purchase.php

    public function purchaseTotalDebitNote()
    {
        return $this->hasMany(PurchaseDebitNote::class, 'purchase', 'id')->sum('amount');
---
select sum(`amount`) as aggregate from `purchase_debit_notes` where `purchase_debit_notes`.`purchase` is null and `purchase_debit_notes`.`purchase` is not null